Public Attributes | List of all members
API_RailingRailEndQuantity Struct Reference
Element Manager API
Calculated values for the rail end of the railing. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
Volume of the given rail end.
double  | length3D
Length of the 3D reference line of the given rail end.
Detailed Description
Calculated values for the rail end of the railing.
Member Data Documentation
◆ length3D
 API_RailingRailEndQuantity::length3D
Length of the 3D reference line of the given rail end.
◆ volume
 API_RailingRailEndQuantity::volume
Volume of the given rail end.